# RoomOutdoorAirflowParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomOutdoorAirflowParam Property
ParameterTypeId Class See Also
---
"Outdoor Airflow"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomOutdoorAirflowParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomOutdoorAirflowParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomOutdoorAirflowParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace